# Дубликаты 

import pandas as pd

orders = pd.DataFrame({
    "order_id": [101, 102, 103, 104],
    "customer_id": [1, 2, 1, 4],
    "amount": [5000, 3000, 7000, 2000]
})

# представим, что справочник клиентов содержит дубликат:

customers_bad = pd.DataFrame({
    "customer_id": [1, 1, 2],    
    "name": ["Анна", "Анна (дубликат)", "Борис"]
})

result = orders.merge(    
    customers_bad,    
    on="customer_id",    
    how="left"
)

print(result)

# Каждый заказ клиента № 1 сопоставится с обеими строками справочника. Поэтому один заказ превратится в две строки.
# Это может привести к завышению выручки, количества заказов и других метрик.