import pandas as pd

sales = pd.DataFrame({
    "city": ["Москва", "Москва", "Тверь", "Тверь"],
    "month": ["Январь", "Февраль", "Январь", "Февраль"],
    "revenue": [100000, 120000, 40000, 50000]
})

# Мы хотим получить отдельный столбец для каждого месяца.

wide = sales.pivot(
    index="city",
    columns="month",
    values="revenue"
)

print(wide)

# index — какие значения станут строками результата;
# columns — какие значения станут новыми столбцами;
# values — какие данные попадут в ячейки

# комбинация index и columns должна однозначно определять значение
# Если для одного города и месяца есть несколько записей, pivot() выдаст ошибку.