# melt() — преобразование столбцов в строки

import pandas as pd

# таблица имеет широкий формат

wide = pd.DataFrame({
    "city": ["Москва", "Тверь"],
    "Январь": [100000, 40000],
    "Февраль": [120000, 50000]
})

# выполним обратную операцию

long = wide.melt(
    id_vars="city",
    var_name="month",
    value_name="revenue"
)

print(long)

# id_vars — столбцы, которые нужно сохранить как идентификаторы;
# var_name — название столбца с бывшими именами колонок;
# value_name — название столбца со значениями.

# melt() особенно полезен при подготовке данных для 
# BI-систем, графиков и аналитических моделей, 
# которым удобнее получать один столбец с названием показателя 
# и другой — с его значением.