# у нас есть заказы:

import pandas as pd

orders = pd.DataFrame({
    "order_id": [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    "city": [
        "Москва", "Тверь", "Москва", "Казань",
        "Тверь", "Москва", "Казань"
    ],
    "category": [
        "Ноутбуки", "Аксессуары", "Ноутбуки",
        "Мониторы", "Аксессуары", "Мониторы",
        "Ноутбуки"
    ],
    "amount": [50000, 3000, 70000, 25000, 5000, 30000, 45000],
    "status": [
        "completed", "completed", "cancelled",
        "completed", "completed", "completed", "completed"
    ]
})

print(orders)

# Бизнес задаёт вопросы:
# 1. Какая выручка по городам?
# 2. Сколько заказов в каждой категории?
# 3. Какой средний чек?
# 4. Сколько заказов в каждом статусе?

# Для ответа на вопросы нам понадобится группировка