# В аналитике данных часто нужно отвечать на вопросы:
# - Сколько времени прошло между созданием заказа и его доставкой?
# - К какому дню или месяцу относится продажа?
# - В какой временной зоне произошло событие?
# - Какие события произошли за последние 24 часа?
# - Как объединить данные из систем, использующих разное локальное время?

# В Python для работы с датой и временем используются datetime, date, time, timedelta и timezone из стандартного модуля datetime.

# Основные типы
# Тип	        Что хранит	        Пример
# date	        Дату	            2026-10-22
# time	        Время суток	        14:30:00
# datetime	    Дату и время	    2026-10-22 14:30:00
# timedelta	    Длительность	    3 дня и 2 часа

from datetime import date, datetime, timedelta

today = date(2026, 10, 22)
created_at = datetime(2026, 10, 22, 14, 30)
delivery_time = timedelta(hours=5)

print(today)
print(created_at)
print(created_at + delivery_time)