# Как рассчитать показатель внутри каждой группы, но сохранить исходные строки?
# Есть ли в pandas аналог оконных функций?

# Например, как увидеть каждый заказ и рядом средний чек города, в котором он был сделан.
# Для этого нужны transform, filter и понимание MultiIndex.



# обычный agg
import pandas as pd

orders = pd.DataFrame({
    "order_id": [1001, 1002, 1003, 1004, 1005, 1006],
    "city": ["Москва", "Москва", "Тверь", "Тверь", "Москва", "Тверь"],
    "amount": [10000, 30000, 5000, 15000, 20000, 10000]
})

# Считаем средний чек по городам:
result = orders.groupby("city")["amount"].mean()

print(result)

# мы потеряли детализацию заказов в результате агрегации.

# бизнес хочет видеть:
# order_id	city	amount	city_average
# 1001	Москва	10000	20000
# 1002	Москва	30000	20000
# 1003	Тверь	5000	10000
# 1004	Тверь	15000	10000
# 1005	Москва	20000	20000
# 1006	Тверь	10000	10000