import numpy as np

sales = np.array([
    [12000, 15000, 11000, 18000],
    [14000, 17000, 13000, 21000],
    [11000, 19000, 16000, 22000]
])

#              Пн     Вт     Ср     Чт
# Неделя 1   12000  15000  11000  18000
# Неделя 2   14000  17000  13000  21000
# Неделя 3   11000  19000  16000  22000

# Общая выручка
print(sales.sum())

# Выручка каждой недели
weekly_revenue = sales.sum(axis=1)
print(weekly_revenue)

# Неделя 1 → 56 000
# Неделя 2 → 65 000
# Неделя 3 → 68 000

# Выручка каждого дня
daily_revenue = sales.sum(axis=0)
print(daily_revenue)

# нужно получить сумму по неделям — поэтому я схлопываю строки:
# axis=1

# нужно получить сумму по дням — схлопываю столбцы:
# axis=0



# axis=1

# [12000 15000 11000 18000] → 56000
# [14000 17000 13000 21000] → 65000
# [11000 19000 16000 22000] → 68000